davisRoman/SDK_2_9_0_EVK-MIMX8DXL/boards/evkmimx8dxl/lwip_examples/lwip_httpsrv_enet_qos/bm/pin_mux.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v8.0
processor: MIMX8DL1xxxFZ
package_id: MIMX8DL1AVNFZ
mcu_data: ksdk2_0
processor_version: 0.8.0
board: MIMX8DXL-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"
#include "fsl_common.h"
#include "main/imx8dxl_pads.h"
#include "svc/pad/pad_api.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'false', coreID: m4}
- pin_list:
  - {pin_num: AC33, peripheral: M40__UART0, signal: uart_rx, pin_signal: ADC_IN2, sw_config: sw_config_0}
  - {pin_num: AF34, peripheral: M40__UART0, signal: uart_tx, pin_signal: ADC_IN3, sw_config: sw_config_0}
  - {pin_num: R29, peripheral: CONN__ENET1, signal: enet_rgmii_tx_ctl, pin_signal: ENET1_RGMII_TX_CTL, sw_config: sw_config_0}
  - {pin_num: G33, peripheral: CONN__ENET1, signal: enet_rgmii_rxc, pin_signal: ENET1_RGMII_RXC, sw_config: sw_config_0}
  - {pin_num: J33, peripheral: CONN__ENET1, signal: 'enet_rgmii_rxd, 0', pin_signal: ENET1_RGMII_RXD0, sw_config: sw_config_0}
  - {pin_num: L33, peripheral: CONN__ENET1, signal: 'enet_rgmii_txd, 3', pin_signal: ENET1_RGMII_TXD3, sw_config: sw_config_0}
  - {pin_num: N33, peripheral: CONN__ENET1, signal: 'enet_rgmii_txd, 0', pin_signal: ENET1_RGMII_TXD0, sw_config: sw_config_0}
  - {pin_num: F34, peripheral: CONN__ENET1, signal: 'enet_rgmii_rxd, 1', pin_signal: ENET1_RGMII_RXD1, sw_config: sw_config_0}
  - {pin_num: H34, peripheral: CONN__ENET1, signal: 'enet_rgmii_rxd, 2', pin_signal: ENET1_RGMII_RXD2, sw_config: sw_config_0}
  - {pin_num: M34, peripheral: CONN__ENET1, signal: 'enet_rgmii_txd, 2', pin_signal: ENET1_RGMII_TXD2, sw_config: sw_config_0}
  - {pin_num: G35, peripheral: CONN__ENET1, signal: 'enet_rgmii_rxd, 3', pin_signal: ENET1_RGMII_RXD3, sw_config: sw_config_0}
  - {pin_num: J35, peripheral: CONN__ENET1, signal: enet_rgmii_rx_ctl, pin_signal: ENET1_RGMII_RX_CTL, sw_config: sw_config_0}
  - {pin_num: L35, peripheral: CONN__ENET1, signal: enet_rgmii_txc, pin_signal: ENET1_RGMII_TXC, sw_config: sw_config_0}
  - {pin_num: N35, peripheral: CONN__ENET1, signal: 'enet_rgmii_txd, 1', pin_signal: ENET1_RGMII_TXD1, sw_config: sw_config_0}
  - {pin_num: K34, peripheral: CONN__ENET1, signal: enet_refclk_125m_25m, pin_signal: ENET1_REFCLK_125M_25M, sw_config: sw_config_0}
  - {pin_num: E33, peripheral: CONN__ENET1, signal: enet_mdc, pin_signal: ENET0_MDC, sw_config: sw_config_0}
  - {pin_num: E35, peripheral: CONN__ENET1, signal: enet_mdio, pin_signal: ENET0_MDIO, sw_config: sw_config_0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(sc_ipc_t ipc)                          /*!< Function assigned for the core: Cortex-M4F[m4] */
{
  sc_err_t err = SC_ERR_NONE;

  err = sc_pad_set_all(ipc, BOARD_INITPINS_ADC_IN2_PIN_FUNCTION_ID, 1U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ADC_IN2 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ADC_IN3_PIN_FUNCTION_ID, 1U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ADC_IN3 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET0_MDC_PIN_FUNCTION_ID, 2U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET0_MDC register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET0_MDIO_PIN_FUNCTION_ID, 2U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET0_MDIO register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_REFCLK_125M_25M_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_REFCLK_125M_25M register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_RXC_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_RXC register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_RXD0_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_RXD0 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_RXD1_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_RXD1 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_RXD2_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_RXD2 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_RXD3_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_RXD3 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_RX_CTL_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_RX_CTL register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_TXC_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_TXC register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_TXD0_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_TXD0 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_TXD1_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_TXD1 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_TXD2_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_TXD2 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_TXD3_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_TXD3 register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
  err = sc_pad_set_all(ipc, BOARD_INITPINS_ENET1_RGMII_TX_CTL_PIN_FUNCTION_ID, 3U, SC_PAD_CONFIG_NORMAL, SC_PAD_ISO_OFF, 0x0 ,SC_PAD_WAKEUP_OFF);/* IOMUXD_ENET1_RGMII_TX_CTL register modification value */
  if (SC_ERR_NONE != err)
  {
      assert(false);
  }
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
